перем АдресВХранилище экспорт;

&НаКлиенте
Процедура ДобавитьИзСпискаЗадач(Команда)
	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	ОткрытьФорму("Документ.ЗадачаКурьеру.ФормаВыбора",ПараметрыФормы, Элементы.СписокЗадач);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ключ = Новый УникальныйИдентификатор();
	ЭтаФорма.КлючУникальности = Ключ;
	АдресВХранилище = ПоместитьВоВременноеХранилище(Ключ);
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СписокРеквизитов = Новый Структура;
	СписокРеквизитов.Вставить("Клиент",NULL);
	СписокРеквизитов.Вставить("Сдача",NULL);
	СписокРеквизитов.Вставить("Документ",NULL);
	СписокРеквизитов.Вставить("Сумма",NULL);
	СписокРеквизитов.Вставить("Адрес",NULL);
	СписокРеквизитов.Вставить("Телефон",NULL);
	СписокРеквизитов.Вставить("Время",NULL);
	СписокРеквизитов.Вставить("СпособОплаты",NULL);


	
	Для каждого ВыбранныйЭлемент из ВыбранноеЗначение Цикл
		Элементы.СписокЗадач.ДобавитьСтроку();
		ПолучитьРеквизитНаСервере(ВыбранныйЭлемент,СписокРеквизитов);
		
		Строка = Элементы.СписокЗадач.ТекущиеДанные;
		Строка.Клиент = СписокРеквизитов.Клиент;
		Строка.Сдача = СписокРеквизитов.Сдача;
		Строка.Сумма = СписокРеквизитов.Сумма;
	
		Строка.Телефон = СписокРеквизитов.Телефон;
		Строка.Документ = СписокРеквизитов.Документ;
		Строка.Адрес = СписокРеквизитов.Адрес;
		Строка.Время = СписокРеквизитов.Время;
		Строка.СпособОплаты = СписокРеквизитов.СпособОплаты;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьРеквизитНаСервере(СсылкаНаДок,СписокРеквизитов)
	СписокРеквизитов.Клиент = СсылкаНаДок.ФИО_клиента;   
	СписокРеквизитов.Сдача = Строка(СсылкаНаДок.СдачаДляКурьеров);
	СписокРеквизитов.Сумма = СсылкаНаДок.ИтоговаяСумма;
	СписокРеквизитов.Адрес = СсылкаНаДок.АдресДоставки;
	СписокРеквизитов.Телефон = СсылкаНаДок.Телефон;
	СписокРеквизитов.Документ = СсылкаНаДок.Ссылка;
	СписокРеквизитов.Время = СсылкаНаДок.ДатаИВремяДоставки;
	СписокРеквизитов.СпособОплаты = Строка(СсылкаНаДок.СпособОплаты);
	
КонецПроцедуры