
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Резервы.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Резервы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количесто = ТекСтрокаТовары.Количество;
		Движение.РозничнаяЦена = ТекСтрокаТовары.ЦенаЕдиницы;
	КонецЦикла;
	
	Движения.ТоварыВНаличии.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ТоварыВНаличии.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	ЗадачаКурьеру = Документы.ЗадачаКурьеру.СоздатьДокумент();
	ЗадачаКурьеру.ФИО_клиента = ФИО_клиента;
	ЗадачаКурьеру.АдресДоставки = АдресДоставки;
	ЗадачаКурьеру.ДатаИВремяДоставки = ДатаИВремяДоставки;
	ЗадачаКурьеру.Телефон = Телефон;
	ЗадачаКурьеру.СдачаДляКурьеров = СдачаДляКурьеров;
	ЗадачаКурьеру.ИтоговаяСумма = ИтоговаяСумма;
	ЗадачаКурьеру.СпособОплаты = СпособОплаты;
	ЗадачаКурьеру.Дата = ТекущаяДата();
	ЗадачаКурьеру.ДокументОснование = ЭтотОбъект.Ссылка;

	ЗадачаКурьеру.Записать(РежимЗаписиДокумента.Проведение);
	
		
КонецПроцедуры


