&НаКлиенте
Процедура Отобрать(Команда)
	ОтборПоДоставке = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); //Добавлям отбор
	ОтборПоДоставке.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; //Как будем сравнивать
	ОтборПоДоставке.Использование = Истина; // Устанавливаем галку использованияНовый ПолеКомпоновкиДанных("Номенклатура")
	ОтборПоДоставке.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Доставлено"); //По какому реквизиту будем делать отбор
	ОтборПоДоставке.ПравоеЗначение = Ложь; // И само значение отбора    
	
	ОтборПоОбработке = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); //Добавлям отбор
	ОтборПоОбработке.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; //Как будем сравнивать
	ОтборПоОбработке.Использование = Истина; // Устанавливаем галку использованияНовый ПолеКомпоновкиДанных("Номенклатура")
	ОтборПоОбработке.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВОбработке"); //По какому реквизиту будем делать отбор
	ОтборПоОбработке.ПравоеЗначение = Ложь; // И само значение отбора    
КонецПроцедуры


