
&НаКлиенте
Процедура ДобавитьИзСпискаЗаказов(Команда)
	
	//ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	ОткрытьФорму("Документ.Заказ.ФормаВыбора",, Элементы.Товары);

КонецПроцедуры




&НаСервере
Процедура ЗаказОснованиеПриИзмененииНаСервере()
	
	мОбъект = РеквизитФормыВЗначение("Объект");
		
	мОбъект.Принял = Строка(мОбъект.ЗаказОснование.ФИО_клиента);
	
	мТчТоварыЗаказа = мОбъект.ЗаказОснование.Товары;
	
	
	мОбъект.Товары.Очистить();
	Для Каждого СтрокаТовары Из мТчТоварыЗаказа Цикл
		
		НоваяСтрока =  мОбъект.Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТовары) ;
		
	КонецЦикла;
	
	
	ЗначениеВРеквизитФормы(мОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказОснованиеПриИзменении(Элемент)
	
	ПараметрыВопроса = Новый Структура;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ПараметрыВопроса);
	ПоказатьВопрос(Оповещение, "Перезаполнить по заказу?" , РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ПараметрыВопроса) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
		ЗаказОснованиеПриИзмененииНаСервере();

	
КонецПроцедуры